# GetTemporaryViewPropertiesId Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
View..::..GetTemporaryViewPropertiesId Method
View Class See Also
---
When Temporary View Properties mode is in progress it provides view id that overrode settings for current view. Outside Temporary View Properties mode InvalidElementId will be returned.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public ElementId GetTemporaryViewPropertiesId()
```

Visual Basic
---
```text
Public Function GetTemporaryViewPropertiesId As ElementId
```

Visual C++
---
```text
public:
ElementId^ GetTemporaryViewPropertiesId()
```

# Remarks
Returned ElementId might refer to element that was deleted. It will happen when Temporary View Properties mode was applied basing on template that next was deleted.
# See Also
View Class
Autodesk.Revit.DB Namespace